{
    "title": "Spicy Chicken Sandwich",
    "id": "EHlG4d",
    "description": "The Summer of 2019 with go down as the Chicken Sandwich Battle of the Century. Popeyes has been swarmed with hungry folks for two weeks straight! Everyone wants their chicken sandwich! They were so overwhelmed that they had to temporarily remove it from their menu. Of course, my chicken sandwich junkies came to me for my version. Naturally, I hopped to it to satisfy my spoiled Cookies!\n\nJuicy chicken is the foundation for the perfect Chicken Sandwich. Some like to pound of the breasts to make them thinner. I leave them as is. Thick and juicy breasts are key in my chicken sandwich! We like it spicy! So, I didn’t spare the spice! My blend works every time! I love a good crunch in my sandwich! The key is to incorporate some of the wet brine into the dry flour mixture. It will create little pockets of crunch during the frying! To pack on the heat, I made a super easy and flavorful spicy mayo! It paired extremely well with our sandwich. I also add Gator Pickles. Google them!! They are absolutely delicious! They are spicy bread and butter pickles. Yes, a dream come true! Hopefully, my Spicy Chicken Sandwich will satiate the Chicken Sandwich craze for my Cookies! I worked hard to make sure every aspect complimented each other well. Don’t divert from my recipe! If you can handle a little spice, try it exactly as written. You deserve it!",
    "image": "https://i.imgur.com/WKGUZSX.jpg",
    "servingSize": 4,
    "scoville": 25000,
    "time": [
        {
            "name": "prepTime",
            "hours": 4,
            "minutes": 10
        },
        {
            "name": "cookTime",
            "hours": 0,
            "minutes": 10
        },
        {
            "name": "totalTime",
            "hours": 4,
            "minutes": 20
        }
    ],
    "ingredientList": [
        {
            "name": "Boneless skinless chicken breasts",
            "quantity": "4",
            "units": "N/A"
        },
        {
            "name": "Buttermilk",
            "quantity": "2",
            "units": "cups"
        },
        {
            "name": "Cajun seasoning",
            "quantity": "2",
            "units": "tbsp"
        },
        {
            "name": "Hot Sauce",
            "quantity": "2",
            "units": "tbsp"
        },
        {
            "name": "Self Rising Flour",
            "quantity": "2",
            "units": "cups"
        },
        {
            "name": "Cornstarch",
            "quantity": "1",
            "units": "tbsp"
        },
        {
            "name": "Canola oil for frying",
            "quantity": "",
            "units": "N/A"
        },
        {
            "name": "Brioche buns",
            "quantity": "4",
            "units": "N/A"
        },
        {
            "name": "Poultry seasoning",
            "quantity": "2",
            "units": "tbsp"
        },
        {
            "name": "Onion powder",
            "quantity": "1",
            "units": "tbsp"
        },
        {
            "name": "Garlic powder",
            "quantity": "1",
            "units": "tsp"
        },
        {
            "name": "Black pepper",
            "quantity": "1",
            "units": "tsp"
        },
        {
            "name": "Cayenne pepper",
            "quantity": "1",
            "units": "tsp"
        },
        {
            "name": "Accent seasoning",
            "quantity": "1",
            "units": "tsp"
        },
        {
            "name": "Celery salt",
            "quantity": "0.5",
            "units": "tsp"
        }
    ],
    "directions": [
        "Mix the buttermilk, Cajun seasoning, and hot sauce together in a bowl.",
        "Add in the chicken.",
        "Cover with plastic wrap and refrigerate for 4 hours or overnight.",
        "In a shallow dish, mix the flour, cornstarch, and spice blend together.",
        "Pour 3 TBS of the buttermilk mixture into the flour mixture and stir until little lumps are formed.",
        "Dredge each breast into the flour mixture. Be sure to press and pack the flour onto each breast.",
        "Shake off the excess flour and refrigerate the battered breasts for 20 mins.",
        "Preheat a deep fryer to 350 F.",
        "Fry each breast in canola oil for 9-10 mins or until it reaches an internal temp of 170 F.",
        "Drain breasts on a paper towel.",
        "Allow chicken to rest for 5 minutes.",
        "Assemble the sandwich as desired.",
        "Enjoy!"
    ],
    "challenges": [],
    "completed": false,
    "spiceRating": 3
}