{
  "title": "Caramelized Honey Spicy Fried Chicken",
  "id": "hAxjit",
  "description": "This fried chicken is coated with a layer of super-light, extra-crunchy craggy-ness thanks to the tight packing of flour, coupled with a low-temperature shallow fry. It's finished with a drizzle of toasted-honey butter, allowing the hot and flavorful spice dust to stick to every nook and cranny. ",
  "image": "https://i.imgur.com/UnlI18m.jpg",
  "servingSize": 4,
  "scoville": 15000,
  "time": [
    {
      "name": "prepTime",
      "hours": 8,
      "minutes": 0
    },
    {
      "name": "cookTime",
      "hours": 2,
      "minutes": 0
    },
    {
      "name": "totalTime",
      "hours": 10,
      "minutes": 0
    }
  ],
  "ingredientList": [
    {
      "name": "Large Chicken",
      "quantity": "1",
      "units": "N/A"
    },
    {
      "name": "Buttermilk",
      "quantity": "2.25",
      "units": "cups"
    },
    {
      "name": "Frank's RedHot hot sauce",
      "quantity": "0.5",
      "units": "cups"
    },
    {
      "name": "Garlic Powder",
      "quantity": "1",
      "units": "tsp"
    },
    {
      "name": "Onion Powder",
      "quantity": "1",
      "units": "tsp"
    },
    {
      "name": "Ground Black Pepper",
      "quantity": "0.5",
      "units": "tsp"
    },
    {
      "name": "Salt",
      "quantity": "4",
      "units": "tsp"
    },
    {
      "name": "Peanut or Safflower oil",
      "quantity": "5",
      "units": "cups"
    },
    {
      "name": "Flour",
      "quantity": "2.5",
      "units": "cups"
    },
    {
      "name": "Clover Honey",
      "quantity": "0.5",
      "units": "cups"
    },
    {
      "name": "Water",
      "quantity": "2",
      "units": "tbsp"
    },
    {
      "name": "Butter",
      "quantity": "3",
      "units": "tbsp"
    },
    {
      "name": "Arbol Chilies",
      "quantity": "10",
      "units": "N/A"
    },
    {
      "name": "Kashmiri Red Chilies",
      "quantity": "12",
      "units": "N/A"
    },
    {
      "name": "Star Anise",
      "quantity": "2",
      "units": "N/A"
    },
    {
      "name": "Black Cardamom Pod",
      "quantity": "1",
      "units": "N/A"
    },
    {
      "name": "2-inch piece cinnamon",
      "quantity": "1",
      "units": "N/A"
    },
    {
      "name": "Cumin Seeds",
      "quantity": "1",
      "units": "tsp"
    },
    {
      "name": "Sichuan Peppercorns",
      "quantity": "1",
      "units": "tbsp"
    }
  ],
  "directions": [
    "To Prepare and Brine the Chicken: Using a chef's knife, break the chicken down into 2 drumsticks, 2 thighs, and 2 wings and divide each breast half in half (making 4 breast pieces in total); leave all pieces bone-in. Split backbone crosswise into 2 pieces and reserve the neck if you choose to fry it as well.",
    "In a large lidded container or mixing bowl, whisk together buttermilk, hot sauce, garlic powder, onion powder, black pepper, and salt. Add chicken to buttermilk brine, making sure it is fully coated and submerged; cover with lid or plastic wrap. Alternatively, you can place the brine and chicken in a heavy-duty zipper-lock bag and place the bag in a dish to catch any leaks. Place in refrigerator and marinate overnight for at least 8 hours and no more than 12 hours.",
    "For Frying: Fill a 12-inch cast iron skillet with oil. (If using a skillet of a different size, increase or reduce the amount of oil to fill it halfway up.) Attach a clip-on thermometer and preheat the oil to 325°F (163°C), keeping the burner at medium-high heat. Line one sheet tray with paper towels and set a wire rack in another sheet tray.",
    "Whisk together the flour and salt. Drizzle 2 tablespoons of buttermilk brine into the flour and gently toss. Working with one piece of chicken at a time, lift chicken from buttermilk and immediately place it in flour with your \"wet\" hand. Using your other, \"dry\" hand, bury the chicken and press flour into all sides, packing tightly to form large clumps of flour coating each piece. Lift chicken out of flour and shake to remove any loose flour before placing into the hot oil. ",
    "Once the chicken is added to the oil, the temperature will drop to between 250 and 275°F (121 and 135°C). Do not increase the heat to compensate; just allow the oil temperature to gradually return to 325°F as the chicken cooks. The temperature should be up to 300°F after 10 minutes; if not, increase the heat. Fry, turning, until deeply golden brown all over, with extra-dark bits where the chicken makes contact with the pan.",
    "As each piece of chicken is ready, remove from oil to the paper towel–lined sheet tray and season immediately with kosher salt. Transfer chicken to wire rack to rest.",
    "Meanwhile, for the Honey-Butter Drizzle: Add honey to a 1-quart saucepan and caramelize over medium-high heat until deep, nutty brown, with an aroma of burnt sugar. Remove from heat and add water. Return to heat and add butter, stirring until incorporated. Set aside.",
    "For the Spice Dust: Remove stems and seeds from chilies by cutting them open with kitchen shears over a wire rack set over a sheet tray. In a small sauté pan over medium heat, toast chilies until fragrant, warm to the touch, and pliable. Set aside. In the same pan, toast star anise, cardamom, and cinnamon for 30 seconds before adding cumin and Sichuan peppercorns. Toast until fragrant and warm to the touch. In a spice grinder, grind toasted chilies and spices together until fine. Set aside.",
    "Just before serving, drizzle each piece of chicken with honey butter and generously sprinkle on spice dust. Serve with buttermilk waffles, if desired."
  ],
  "challenges": [],
  "completed": false,
  "spiceRating": 2
}